run/thermoMixingTest/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interThermoMixingFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1e-4;//1e-3;

deltaT          2e-8;

writeControl    adjustableRunTime;

writeInterval   1e-5;//1e-5;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.2;
maxAlphaCo      0.2;
maxDi           100.0;

maxDeltaT       5e-8;


// ************************************************************************* //

OptimisationSwitches
{
    fileHandler collated;
}

functions
{
    divU
    {
        type            div;
        libs            ("libfieldFunctionObjects.so");

        writeControl    writeTime;
        writeFields     true;
        regionType      all;

        field           phi;
    }

    maxValue
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        log             true;
        writeControl    timeStep;
        writeFields     false;
        regionType      all;
        operation       maxMag;

        fields (p_rgh U T div(phi));
    }
}