run/thermoMixingTest/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

heatSource
{
    type            coded;
  
    selectionMode   cellSet;

    cellSet         heatSourceSet;

    field           T;

    codeInclude
    #{
    #};

    codeAddSup
    #{
        Pout<< "**codeAddSup**" << endl;
    #};

    codeAddRhoSup
    #{
        Pout<< "**codeAddRhoSup**" << endl;
        const scalar Q = 30.0;
        const scalar q = Q / set_.V();
        const scalarField& V = mesh().V();
        const labelList& cells = set_.cells();
        scalarField& eqnSource = eqn.source();
        forAll(cells, cellI)
        {
            eqnSource[cells[cellI]] -= q * V[cells[cellI]];
        }
    #};

    codeAddAlphaRhoSup
    #{
        Pout<< "**codeAddAlphaRhoSup**" << endl;
    #};
}

//************************************************************************* //
