run/thermoMixingTest/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    zmax
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "(zmin|ymin|ymax)"
    {
        type            zeroGradient;
    }

    "(xmin|xmax)"
    {
        type            empty;
    }
}


// ************************************************************************* //
