run/thermoMixingTest/0/alpha.argon.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      alpha.argon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    zmax
    {
        type            inletOutlet;
        value           uniform 1;
        inletValue      uniform 1;
    }

    "(zmin|ymin|ymax)"
    {
        type            zeroGradient;
    }

    "(xmin|xmax)"
    {
        type            empty;
    }
}


// ************************************************************************* //
