run/thermoMixingTest/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.argon 1
    volScalarFieldValue alpha.steel 0
    volScalarFieldValue alpha.copper 0
);

regions
(   
    boxToCell
    {
    	box (-1 -1 -1) (1 400e-6 0);
    	fieldValues
    	(
    	    volScalarFieldValue alpha.argon 0
            volScalarFieldValue alpha.steel 1
    	);
    }
    
    boxToCell
    {
    	box (-1 400e-6 -1) (1 1 0);
    	fieldValues
    	(
    	    volScalarFieldValue alpha.argon 0
            volScalarFieldValue alpha.copper 1
    	);
    }
);


// ************************************************************************* //
