run/thermoMixingTest/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        action  new;
        type    cellSet;
        name    heatSourceSet;
        source  cylinderToCell;
        radius  50e-6;
        p1      (-1 400e-6 -50e-6);
        p2      ( 1 400e-6 -50e-6);
    }
);

// ************************************************************************* //
